<?php
	//设置字符集
	header("Content-Type:text/html;charset=utf-8");
/**
 * 算数运算符+ - * / % ++ --
 * 比较运算符== === != <> !== <= >=  ? : 
 * 逻辑运算符&& || ! and or xor 
 * 位运算符  &(可以做为逻辑运算符；&&的时候前面错了就直接跳出；而&会执行) 
 *          |(可以做为逻辑运算符) ^(相同为0，不同为1) ~(求反) 
 *          <<(左移乘2) >>(右移除2；如果前是1要补1，否则补0) >>>(无符号右移)
 * 赋值运算符+= -= *= /= %=
 * 其他运算符. .=
 * 
 * 用.来链接字符串
 */

    //算数运算符
    $a =10;
    $b =20;
    $c = $a+$b;
    echo $c;
    echo "</br>";
    if ("100"===100) {
       echo "不止是内容相等，类型也要相等";
       echo "</br>";
    }elseif ("100"==100){
       echo "内容相等";
       echo "</br>";
    }

    //字符串链接；可以链接变量不可以链接其他类型的
    $b=100;
    $a="abc"."xyz".$b;
    echo $a;
    //链接数据库实例
    mysql_connect("localhost","root","root")or die("链接数据库失败！");
?>